---
kind: type
id: T:Autodesk.Revit.DB.PaperSourceSet
source: html/d8c1d4df-2afd-bf11-c8ba-729475c6324e.htm
---
# Autodesk.Revit.DB.PaperSourceSet

A set that can contain any number of paper source objects.

## Syntax (C#)
```csharp
public class PaperSourceSet : APIObject,
	IEnumerable
```